post_app/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "sdfasdf"], ["post_id", 50], ["created_at", 2016-12-28 05:56:47 UTC], ["updated_at", 2016-12-28 05:56:47 UTC], ["user_id", 1]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "jijiasdf"], ["updated_at", 2016-12-28 07:57:21 UTC], ["id", 19]]
---
  def update
    @comment.update(comment_params)