post_app/app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: 5)
---
SELECT  "posts".* FROM "posts" WHERE (body LIKE '%search%' OR title LIKE '%search') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (body LIKE '%%')

  def create
    @post = current_user.posts.build(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "주렁주렁"], ["body", "<p>태민태민~~</p>\r\n"], ["created_at", 2016-12-29 09:14:11 UTC], ["updated_at", 2016-12-29 09:14:11 UTC], ["user_id", 1]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 51], ["LIMIT", 1]]