post_app/app/controllers/users_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @posts=@user.posts.paginate(page:params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save