post_app/app/views/posts/_post.html.erb

  <b>Written at: <%= post.created_at.strftime("%Y/%m/%d %H:%M") %></b><br/>
  <b>Title: <%= post.title %> </b><%= "("+post.comments.count.to_s+")" if post.comments.count != 0%><br/>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 50]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 50]]