post_app/app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "sdfasdf"], ["post_id", 50], ["created_at", 2016-12-28 05:56:47 UTC], ["updated_at", 2016-12-28 05:56:47 UTC], ["user_id", 1]]
---
  <span id="body"><%= comment.body %></span>
  <b id="created_at"><%= comment.created_at.strftime("%Y/%m/%d %H:%M")%></b>