post_app/app/views/users/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 11]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 12]]
---
<% @users.each do |user| %>
  <%= link_to user.name, user %> | <%= link_to user.email,user %> | 총 글: <%= user.posts.count%>, 총 댓글: <%= user.comments.count%>