post_app/app/views/users/show.html.erb

  <strong># of Posts:</strong>
  <%= @user.posts.count%>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]

  <strong># of Comments:</strong>
  <%= @user.comments.count%>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 7]]